v2206/Projects/solverTests/benchmark/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     ADMFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

// endTime         10;
// writeInterval   1;

// endTime         7200;
// writeInterval   300;

// endTime         86400;  // 1 days simulation
// writeInterval   3600;

endTime         864000; // 10 days simulation
writeInterval   3600;

deltaT          1;

writeControl    adjustable;

purgeWrite      0;

writeFormat     ascii; // binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep  true;

runTimeModifiable true;

maxCo           0.8;

maxDeltaT       50;

functions 
{
    probes
    {
        // Where to load it from
        functionObjectLibs ( "libsampling.so" );

        type        probes;

        // Name of the directory for probe data
        name        probes;

        // Fields to be probed
        fields 
        (
            pH
            SIC
            SIN
            Sac
            Sh2
            Sch4
            Gch4
        );

        probeLocations
        (
           ( .25  .25  -.005 )         // at center of the motor bike mask
        );

        writeControl    adjustable;
        writeInterval   $writeInterval;
    }

}


// ************************************************************************* //
